import {Row, Col, Divider} from 'antd';

const Setting = ()=>{
  const array = [
    {title: 'Алхам 1 ',
      subTitle: 'БҮРТГҮҮЛЭХ эсвэл НЭВТРЭХ',
      image: '/1.png',
      status: 'Зогсоол түрээслэхэд хамгийн эхэнд та системд бүртгэлтэй, тухайн бүртгэлээрээ системд нэвтэрч орсон байх шаардлагатай. Нэвтрээгүй байгаа бол Төлбөр төлөх хэсэгт дарахад Нэвтрэх хуудас эсвэл бүртгэл үүсгэх хуудасруу шилжиж системд нэвтэрнэ.',
    },
    {title: 'Алхам 2 ',
      subTitle: 'ЗОГСООЛ ХАЙХ',
      image: '/2.png',
      status: 'Өөрт тохирох зогсоолыг олохын тулд та мэдээллээ зөв оруулах шаардлагатай. 2 төрлөөр хайлт хийх боломжтой. 1-т зөвхөн байршлаар, үүн дотроо нэршилээр болон байршил ID, өөрийн байршлаар зэрэг хайлт орно. 2-т үндсэн байршлын мэдээллээс гадна Зогсоолын түрээсийн төрөл болох Өдөр, Шөнө, Бүтэн өдрийн сонголтыг оруулж эхлэх болон дуусах хугацааг оруулж хайлт боломжтой.',
    },
    {title: 'Алхам 3 ',
      subTitle: 'СОНГОХ',
      image: '/3.png',
      status: 'Байршлаар хайлт хийсэн тохиолдолд та өөрт хамгийн тохирох зогсоолыг сонгож тухайн зогсоолын дэлгэрэнгүй хэсгээс Сул цаг сонгох гэсэн товчин дээр дарж сул өдрүүдийг идэвхжүүлэн, төлбөр төлөх товчийг дарж захиалгаа хадгалах боломжтой. Байршил, зогсоолын түрээсийн төрөл, эхлэх болон дуусах хугацааг оруулснаар та өөрт тохирох зогсоолыг байршил, үнэ зэргийн мэдээллээр үнэлж зогсоолын дэлгэрэнгүй хуудаснаас төлбөр төлөх товчин дээр дарж захиалгаа хадгалах боломжтой. ',
    },
    {title: 'Алхам 4 ',
      subTitle: 'ТӨЛБӨР ТӨЛӨХ',
      image: '/4.png',
      status: 'Төлбөр төлөх 3 үндсэн сонголт байгаа. 1-т Uparking  системийн үнсэн төлбөрийн хэрэгсэл болох UWallet хэтэвчнээс төлөх. Хэтэвч цэнэглэх хэсэгт орж өөрийн хэтэвчээ цэнэглэн ашиглах боломжтой. 2-т Хаан, Худалдаа хөгжил, Голомт, Хас банкны интернет банкаар орж Төлбөр төлөх хэсгээс захиалгын шилжүүлгийн мэдээллийг хуулж шилжүүлгэ хийх. 3-т онлайн төлбөрийн системүүд болох Монгол чат, Лэндмн, SocialPay зэргийг ашиглан өөрийн хэтэвчрүү нэхэмжлэх илгээх  төлбөрийг төлөх.',
    },
    {title: 'Алхам 5 ',
      subTitle: 'ЗОГСООЛД БАЙРШУУЛАХ',
      image: '/5.png',
      status: 'Захиалга баталгаажсаны дараа Захиалга цэсний баталгаажсан захиалга хэсэгт захиалга тань шилжиж, зогсоолын нэмэлт мэдээлэлүүд захиалгын дэлгэрэнгүй хуудсан нэмэгдэх болно. Үүнд зогсоолын үндсэн зураг нэмэгдэж, Байрны дугаар, Давхарын дугаар, Зогсоолын дугаар, Uparking дугаар болон зогсоолын план зураг зэрэг мэдээлийг харах боломжтой болно. Та энэхүү мэдээллүүдийн дагуу өөрийн түрээслэсэн зогсоолыг олж автомашинаа байршуулна.',
    },
    {title: 'Алхам 6 ',
      subTitle: 'ЗОГСООЛЫГ ҮНЭЛЭХ',
      image: '/1.png',
      status: 'Зогсоолын түрээсийн хугацаа дуусгавар болсноор 24 цагийн дотор Захиалга цэсний түүх хэсэгт орж зогсоолыг сонгон, зогсоолыг үнэлэх товчин дээр дарж Зогсоолын 4 үзүүлэлтээр 1- 5 одоор үнэлнэ.',
    },
  ];
  return (
    <div>
      <div>
        {array.map((item)=>(
          <div key={item.title} className={'settingPane'} style={{marginTop: '20px'}}>
            <Row>
              <Col span={4} offset={2}><p style={{color: '#0013D4'}}>{item.title}</p></Col>
              <Divider type="vertical" color='#0013D4'/>
              <Col span={15}><p style={{color: '#0013D4', fontSize: '12px', fontWeight: '400'}}><b>{item.subTitle}</b></p></Col>
            </Row>
            <Row style={{marginTop: '10px', alignItems: 'center'}}>
              <Col span={10}>
                <img src={item.image} height='100px' width='188.35px'/>
              </Col>
              <Col span={12} offset={1}>
                <p style={{textAlign: 'justify', fontSize: '10px'}}> {item.status}</p>
              </Col>
            </Row>
          </div>
        ))}
      </div>
    </div>
  );
};
export default Setting;
